"""
เครื่องคำนวณค่าไฟฟ้าแบบขั้นบันได
เขียนโปรแกรมคำนวณต่าไฟฟ้าจากจำนวนค่าใช้ไฟฟ้าที่ใช้ในเดือนนั้น โดยฟังก์ชั่น
calculate_electricty_cost(units)

ค่าไฟฟ้าขึ้นกับปริมาณการใช้ไฟฟ้า
จำนวนหน่วยที่ใช้                   อัตราต่อหน่วย
1-50 หน่วย                      2.50 บาท
51-100 หน่วย                    3.00 บาท
101-200 หน่วย                   3.50 บาท
มากกว่า 200 หน่วย                4.00 บาท

ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน
เงื่อนไข
- โปรแกรมแสดงเมนูซ้ำ
- ผู้ใช้เลือก 1 เพื่อคำนวณค่าไฟ
- ผู้ใช้เลือก 2 เพื่ออกจากโปรแกรม
- หากเลือกเมนูอื่นให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
- จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ
- ให้แสดงรายละเอียดค่าไฟแต่ละช่วง


ตัวอย่างหน้าจอ
====================โปรแกรมคำนวณไฟฟ้า=================
    1.คำนวณไฟฟ้า
    2.ออกจากโปรแกรม
"""
units = 200
if units > 200:
        cost = (2.50*50)+(3.00*50)+(3.50*50)+(4.00+50)+25
        print(units,cost)

elif units > 100:
    cost = (2.50*50)+(3.00*50)+(3.50*50)+25
    print("1-50 หน่วย:125.00 บาท")
    print("51-100 หน่วย:150.00 บาท")
    print(f"101-{units} หน่วย:{(units-100)*3.50} บาท")
    print("ค่าบริการ:25.00 บาท")
    print("รวมค่าไฟฟ้าทั้งสิ้น , cost")


elif units > 50:
    cost = (2.50*50)+(3.00*50)+25
    print(units,cost)

elif units > 0 :
    cost = (2.50*50)+25
    print(units,cost)